chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/processor/usb_p32mx230f064d.h
/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API void PLIB_USB_OTG_InterruptFlagSet(USB_MODULE_ID index, USB_OTG_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_OTG_InterruptFlagSet_Default(index, interruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_OTG_InterruptFlagClear(USB_MODULE_ID index, USB_OTG_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_OTG_InterruptFlagClear_Default(index, interruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_OTG_InterruptFlagGet(USB_MODULE_ID index, USB_OTG_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            return USB_OTG_InterruptFlagGet_Default(index, interruptFlag);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_InterruptStatus(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsOTG_InterruptStatus_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_USB_OTG_InterruptEnable(USB_MODULE_ID index, USB_OTG_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_OTG_InterruptEnable_Default(index, interruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_OTG_InterruptDisable(USB_MODULE_ID index, USB_OTG_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_OTG_InterruptDisable_Default(index, interruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_OTG_InterruptIsEnabled(USB_MODULE_ID index, USB_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            return USB_OTG_InterruptIsEnabled_Default(index, interruptFlag);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_Interrupt(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsOTG_Interrupt_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_OTG_IDPinStateIsTypeA(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_OTG_IDPinStateIsTypeA_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_IDPinState(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsOTG_IDPinState_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_OTG_LineStateIsStable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_OTG_LineStateIsStable_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_LineState(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsOTG_LineState_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_OTG_SessionValid(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_OTG_SessionValid_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_SessionValid(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsOTG_SessionValid_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_OTG_BSessionHasEnded(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_OTG_BSessionHasEnded_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_BSessionEnd(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsOTG_BSessionEnd_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_OTG_VBusValid(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_OTG_VBusValid_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_ASessionValid(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsOTG_ASessionValid_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_USB_OTG_PullUpPullDownSetup(USB_MODULE_ID index, USB_OTG_PULL_UP_PULL_DOWN resistor, bool enableResistor)
{
    switch (index) {
        case USB_ID_1 :
            USB_OTG_PullUpPullDownSetup_Default(index, resistor, enableResistor);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_PullUpPullDown(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsOTG_PullUpPullDown_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_USB_OTG_VBusPowerOff(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_OTG_VBusPowerOff_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_OTG_VBusPowerOn(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_OTG_VBusPowerOn_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_VbusPowerOnOff(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsOTG_VbusPowerOnOff_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

